W4D2/NinetyNineCats/app/controllers/cat_rental_requests_controller.rb

SELECT "cats".* FROM "cats"
---
  def new
    @request = CatRentalRequest.new
    @cats = Cat.all

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 1], ["start_date", "2018-06-06"], ["end_date", "2018-07-20"], ["created_at", "2017-08-23 15:57:59.849745"], ["updated_at", "2017-08-23 15:57:59.849745"]]
---
  def create
    @request = CatRentalRequest.new(cat_rental_request_params)
    if @request.save