W4D2/NinetyNineCats/app/controllers/cats_controller.rb

  def show
    @current_requests = @cat.cat_rental_requests.order('start_date')
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY start_date  [["cat_id", 4]]

  def create
    @cat = Cat.new(cat_params)
    if @cat.save!
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @cat.update(cat_params)
---
UPDATE "cats" SET "name" = $1, "sex" = $2, "color" = $3, "birth_date" = $4, "description" = $5, "updated_at" = $6 WHERE "cats"."id" = $7

  def destroy
    @cat.destroy
---
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 9]]

  def set_cat
    @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]