W7D4/Pokedex/server/app/views/api/pokemon/index.json.jbuilder

    json.item_ids do
      json.array! poke.items.map { |item| item.id }
---
SELECT "items".* FROM "items" WHERE "items"."pokemon_id" = $1  [["pokemon_id", 96]]