W8D1/server/app/controllers/api/benches_controller.rb

  def index
    @benches = params[:bounds] ? Bench.in_bounds(params[:bounds]) : Bench.all
---
SELECT "benches".* FROM "benches" WHERE (lat > '37.74187') AND (lat < '37.80971') AND (lng > '-122.47791') AND (lng < '-122.39208')

  def create
    @bench = Bench.new(bench_params)

    if @bench.save
---
INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Union City"], ["lat", 37.589435], ["lng", -122.028098], ["created_at", "2017-09-17 00:32:43.615318"], ["updated_at", "2017-09-17 00:32:43.615318"]]