W4D2/NinetyNineCatsv2/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @cat = Cat.new(cat_params)
    if @cat.save!

UPDATE "cats" SET "name" = $1, "sex" = $2, "color" = $3, "birth_date" = $4, "description" = $5, "updated_at" = $6 WHERE "cats"."id" = $7
---
  def update
    if @cat.update(cat_params)

DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 9]]
---
  def destroy
    @cat.destroy

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def set_cat
    @cat = Cat.find(params[:id])